<!DOCTYPE html>
<html lang="es">
<head>
  <meta charset="UTF-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0"/>
  <title>Términos y Condiciones | Orbita Capital</title>
  <meta name="description" content="Términos y condiciones de uso de los servicios de Orbita Capital. Conoce tus derechos y obligaciones como usuario.">
  <link rel="icon" href="assets/img/branding/orbita-logo-symbol.png" type="image/png">
  <link href="https://fonts.googleapis.com/css2?family=Poppins:wght@300;400;500;600;700;800&display=swap" rel="stylesheet">
  <link rel="stylesheet" href="assets/css/legal.css" />
  <link rel="stylesheet" href="assets/css/footer.css" />
</head>
<body>

  <div class="legal-hero">
    <div class="legal-hero-content">
      <nav class="legal-breadcrumb">
        <a href="index.html">Inicio</a>
        <span>/</span>
        <span>Términos y Condiciones</span>
      </nav>
      <h1>Términos y Condiciones</h1>
      <p class="legal-subtitle">&Uacute;ltima actualizaci&oacute;n: 04 de agosto de 2025</p>
    </div>
  </div>

  <main class="legal-main">
    <div class="legal-container">

      <div class="legal-meta">
        <div class="legal-meta-item">
          <span class="legal-meta-label">Responsable</span>
          <span class="legal-meta-value">Orbita Capital</span>
        </div>
        <div class="legal-meta-item">
          <span class="legal-meta-label">Nombre comercial</span>
          <span class="legal-meta-value">Orbita Capital</span>
        </div>
        <div class="legal-meta-item">
          <span class="legal-meta-label">Jurisdicci&oacute;n</span>
          <span class="legal-meta-value">Rep&uacute;blica Argentina</span>
        </div>
      </div>

      <div class="legal-toc">
        <h3>&Iacute;ndice</h3>
        <ol>
          <li><a href="#sec-1">Aceptaci&oacute;n de los t&eacute;rminos</a></li>
          <li><a href="#sec-2">Naturaleza del servicio</a></li>
          <li><a href="#sec-3">Acceso y modalidad de pago</a></li>
          <li><a href="#sec-4">Actualizaciones de contenido</a></li>
          <li><a href="#sec-5">Pol&iacute;tica de reembolsos</a></li>
          <li><a href="#sec-6">Acceso al creador y niveles de atenci&oacute;n</a></li>
          <li><a href="#sec-7">Comportamiento dentro de la comunidad</a></li>
          <li><a href="#sec-8">Propiedad intelectual</a></li>
          <li><a href="#sec-9">Edad m&iacute;nima y responsabilidad</a></li>
          <li><a href="#sec-10">Limitaci&oacute;n de responsabilidad</a></li>
          <li><a href="#sec-11">Privacidad de datos</a></li>
          <li><a href="#sec-12">M&eacute;todos de pago aceptados</a></li>
          <li><a href="#sec-13">Modificaci&oacute;n de t&eacute;rminos</a></li>
          <li><a href="#sec-14">Jurisdicci&oacute;n aplicable</a></li>
        </ol>
      </div>

      <article class="legal-content">

        <section class="legal-section" id="sec-1">
          <h2><span class="section-number">01</span> Aceptaci&oacute;n de los t&eacute;rminos</h2>
          <p>Al acceder, contratar o interactuar con los productos, servicios y/o contenidos ofrecidos por Orbita Capital, el usuario acepta plenamente estos T&eacute;rminos y Condiciones. La realizaci&oacute;n de un pago implica la aceptaci&oacute;n autom&aacute;tica de los mismos.</p>
          <p>Si no est&aacute; de acuerdo con alguno de los puntos aqu&iacute; establecidos, debe abstenerse de acceder al contenido o realizar cualquier pago.</p>
        </section>

        <section class="legal-section" id="sec-2">
          <h2><span class="section-number">02</span> Naturaleza del servicio</h2>
          <p>Orbita Capital ofrece formaciones digitales, mentor&iacute;as y programas educativos enfocados en trading, desarrollo de mentalidad y crecimiento personal aplicado a los mercados financieros.</p>
          <p>Todo el contenido se proporciona en formato digital, incluyendo clases grabadas, acceso a comunidad privada y material de apoyo. No se ofrece atenci&oacute;n presencial.</p>
        </section>

        <section class="legal-section" id="sec-3">
          <h2><span class="section-number">03</span> Acceso y modalidad de pago</h2>
          <p>Para acceder a la formaci&oacute;n, se requiere:</p>
          <ul>
            <li>Crear una cuenta en la plataforma.</li>
            <li>Realizar el pago correspondiente seg&uacute;n el programa elegido.</li>
          </ul>
          <p>El acceso al contenido se otorga &uacute;nicamente tras completar ambos pasos. Actualmente, la membres&iacute;a de Fase 1 es de pago &uacute;nico con acceso de por vida. Orbita Capital se reserva el derecho de modificar el modelo comercial, lo cual ser&aacute; informado oportunamente a los usuarios.</p>
        </section>

        <section class="legal-section" id="sec-4">
          <h2><span class="section-number">04</span> Actualizaciones de contenido</h2>
          <p>La membres&iacute;a incluye acceso al contenido actual y a sus actualizaciones regulares sin costo adicional, mientras dure la vigencia del programa contratado. Nuevos programas independientes podr&aacute;n tener un costo diferente.</p>
        </section>

        <section class="legal-section" id="sec-5">
          <h2><span class="section-number">05</span> Pol&iacute;tica de reembolsos</h2>
          <div class="legal-highlight">
            <p>Los reembolsos son posibles &uacute;nicamente si se cumplen ambas condiciones:</p>
            <ul>
              <li>El usuario no ha accedido al contenido.</li>
              <li>La solicitud se realiza antes de recibir el acceso.</li>
            </ul>
          </div>
          <p>Una vez otorgado el acceso, incluso si fue por un solo minuto, no habr&aacute; posibilidad de reembolso bajo ninguna circunstancia, dado que se trata de contenido exclusivo, digital y protegido por derechos de autor.</p>
        </section>

        <section class="legal-section" id="sec-6">
          <h2><span class="section-number">06</span> Acceso al creador y niveles de atenci&oacute;n</h2>
          <p>El acceso a Orbita Capital es limitado. No se garantiza atenci&oacute;n personalizada individual. Para contacto directo o mentor&iacute;as uno a uno, el usuario deber&aacute; adquirir servicios premium adicionales cuando est&eacute;n disponibles.</p>
        </section>

        <section class="legal-section" id="sec-7">
          <h2><span class="section-number">07</span> Comportamiento dentro de la comunidad</h2>
          <p>Para mantener un entorno profesional y respetuoso, el usuario se compromete a:</p>
          <ul>
            <li>No insultar, discriminar ni generar conflictos con otros miembros.</li>
            <li>Evitar contenido obsceno o vulgar, incluyendo mensajes, stickers e im&aacute;genes.</li>
            <li>Cumplir con las normas internas del grupo en todo momento.</li>
          </ul>
          <p>El incumplimiento de estas normas podr&aacute; resultar en la expulsi&oacute;n inmediata sin previo aviso ni reembolso.</p>
        </section>

        <section class="legal-section" id="sec-8">
          <h2><span class="section-number">08</span> Propiedad intelectual</h2>
          <p>Todo el contenido entregado &mdash; videos, estrategias, PDFs, textos, grabaciones y metodologias &mdash; es propiedad exclusiva de Orbita Capital y está protegido por derechos de autor.</p>
          <p>Queda expresamente prohibido:</p>
          <ul>
            <li>Compartir el contenido con terceros no autorizados.</li>
            <li>Publicarlo en plataformas p&uacute;blicas o privadas.</li>
            <li>Vender, revender o reproducir materiales creados por Orbita Capital.</li>
          </ul>
          <p>El uso personal de los conocimientos adquiridos est&aacute; permitido, siempre que no implique la reproducci&oacute;n directa del contenido protegido. La violaci&oacute;n de estos t&eacute;rminos resultar&aacute; en baneo permanente y posibles acciones legales.</p>
        </section>

        <section class="legal-section" id="sec-9">
          <h2><span class="section-number">09</span> Edad m&iacute;nima y responsabilidad</h2>
          <p>Los servicios est&aacute;n destinados exclusivamente a personas mayores de 18 a&ntilde;os. Cada usuario es responsable de sus propias decisiones, acciones e inversiones derivadas del uso del contenido. Orbita Capital no se responsabiliza por resultados individuales ni por el uso o mal uso de la informaci&oacute;n proporcionada.</p>
        </section>

        <section class="legal-section" id="sec-10">
          <h2><span class="section-number">10</span> Limitaci&oacute;n de responsabilidad</h2>
          <div class="legal-highlight">
            <p>El contenido ofrecido tiene una naturaleza educativa y formativa, enfocado en trading y desarrollo de mentalidad. No constituye asesoramiento legal, financiero, m&eacute;dico ni psicol&oacute;gico profesional.</p>
          </div>
          <p>La contrataci&oacute;n de cualquier servicio implica que el usuario acepta esta aclaraci&oacute;n y asume plena responsabilidad sobre las decisiones que tome bas&aacute;ndose en el contenido.</p>
        </section>

        <section class="legal-section" id="sec-11">
          <h2><span class="section-number">11</span> Privacidad de datos</h2>
          <p>Se recopilan &uacute;nicamente los datos necesarios: nombre, correo electr&oacute;nico y, eventualmente, CUIL o n&uacute;mero de WhatsApp. Estos datos se utilizan exclusivamente para:</p>
          <ul>
            <li>Gestionar el acceso al contenido contratado.</li>
            <li>Mejorar la experiencia del usuario.</li>
          </ul>
          <p>No se venden ni comparten con terceros con fines comerciales. Para m&aacute;s informaci&oacute;n, consult&aacute; nuestra <a href="politica-de-privacidad.html">Pol&iacute;tica de Privacidad</a>.</p>
        </section>

        <section class="legal-section" id="sec-12">
          <h2><span class="section-number">12</span> M&eacute;todos de pago aceptados</h2>
          <div class="legal-payment-methods">
            <span class="payment-badge">MercadoPago</span>
            <span class="payment-badge">Stripe</span>
            <span class="payment-badge">Skrill</span>
            <span class="payment-badge">PayPal</span>
            <span class="payment-badge">Transferencia bancaria</span>
            <span class="payment-badge">Criptomonedas</span>
          </div>
        </section>

        <section class="legal-section" id="sec-13">
          <h2><span class="section-number">13</span> Modificaci&oacute;n de t&eacute;rminos</h2>
          <p>Orbita Capital se reserva el derecho de modificar estos T&eacute;rminos y Condiciones en cualquier momento. Las actualizaciones se publicar&aacute;n en los canales oficiales y el uso continuado del servicio implicar&aacute; la aceptaci&oacute;n autom&aacute;tica de las nuevas condiciones.</p>
        </section>

        <section class="legal-section" id="sec-14">
          <h2><span class="section-number">14</span> Jurisdicci&oacute;n aplicable</h2>
          <p>Este acuerdo se rige por las leyes vigentes en la Rep&uacute;blica Argentina. Cualquier conflicto ser&aacute; tratado conforme a las normativas locales aplicables.</p>
        </section>

      </article>

      <div class="legal-nav-links">
        <a href="politica-de-privacidad.html" class="legal-nav-card">
          <span class="legal-nav-label">Siguiente</span>
          <span class="legal-nav-title">Política de Privacidad &rarr;</span>
        </a>
        <a href="preguntas-frecuentes.html" class="legal-nav-card">
          <span class="legal-nav-label">Consultas</span>
          <span class="legal-nav-title">Preguntas Frecuentes &rarr;</span>
        </a>
      </div>

    </div>
  </main>

  <!-- Footer (shared component) -->
  <div id="footer"></div>

  <script src="assets/js/footer.js"></script>
</body>
</html>